Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/M12A.tmx
Source language: en_us
Languages: zh_cn

source: Ringing up baby
zh_cn: 订制小妹

source: Nanny says that I am spoiled.
zh_cn: 奶奶说我被惯坏了。

source: It comes from being an only child, and not having to share holidays or cakes and always getting to sit by the window.
zh_cn: 因为我是独生女，不用和兄弟姐妹分享假期或蛋糕，总是能坐到窗边的好位子。

source: If I had a little brother or sister, I would learn responsibility.
zh_cn: 如果我有一个小弟弟或者小妹妹，我会学到如何承担责任。

source: More work for her, she sighs, but she is only thinking of my character.
zh_cn: 奶奶叹气道，那意味着她有更多的活要做，但她现在只想着我的性格。

source: Thinking about me is Nanny's job.
zh_cn: 为我考虑，就是奶奶的差事。

source: Of course, Mother is far too busy to have a baby right now, what with the Henderson case and all.
zh_cn: 当然，妈妈工作很忙碌，忙着办亨德森案件和其他事情，眼下没时间生孩子。

source: (When I have supper with her, on Wednesdays, she talks about nothing but the Henderson case.) So Nanny has arranged for a nice lady to plant Mother's egg and do all the messy parts, then give the baby to us when it's done.
zh_cn: （每个星期三，我和妈妈吃晚饭时，她说的全都和亨德森案件有关。）所以，奶奶安排了一位很好的阿姨，她会植入妈妈的卵子，然后负责剩下的所有麻烦事，最后在生产后将婴儿留给我们。

source: "What would you like," Nanny asks me over cocoa. "A brother or a sister?"
zh_cn: “你是想要，”奶奶在我喝热可可时问我，“一个弟弟还是一个妹妹？”

source: I have to think for a moment, but only a little, because a brother would be a pest and get into my best things, like Courtney Taylor's brother Robby, who programmed her mobile phone to ring with a nasty farting sound.
zh_cn: 我得好好思量一下，可只用了一小会工夫，答案就蹦出来了。一个弟弟会是个讨厌鬼，抢走我最好的东西，就像科特妮·泰勒的小弟罗比，他修改了姐姐的手机程序，将铃声换成了恶心的放屁声音。

source: A sister is someone I can be the boss of.
zh_cn: 如果是个妹妹，我就能对其发号施令了。

source: "A sister, please," I say in my sweet voice.
zh_cn: “我要个妹妹。”我用自己甜甜的嗓音说道。

source: Nanny loves my sweet voice.
zh_cn: 奶奶爱死了我甜甜的嗓音。

source: Nanny touches a box on the wall screen, and it glows bright pink.
zh_cn: 奶奶碰触了墙壁屏幕上的一个盒子，盒子随即发出粉红色的亮光。

source: "Birthday?" she asks, her finger not quite touching the screen, but ready.
zh_cn: “生日呢？”奶奶又问我，她的手指其实没有碰触到屏幕，只是摆出了预备姿势。

source: My birthday is in June.
zh_cn: 我的生日是在六月份。

source: "October," I say after a minute, because I've had to count in my head, so her party won't get in the way of Christmas, either.
zh_cn: “十月。”我想了一下后才说道，因为我必须在脑子里算下日子，那样妹妹的生日派对也不会妨碍圣诞节的活动。

source: "Excellent," says Nanny. "We can place our order today."
zh_cn: “好极了。”奶奶说，“我们今天就能下好订单。”

source: She taps her finger on the screen. That box glows red.
zh_cn: 她轻叩屏幕，那个盒子发出了红光。

source: "What else can we pick?"
zh_cn: “我们还能选择什么？”

source: There are a lot of boxes.
zh_cn: 屏幕上有许多盒子。

source: I finish my cocoa and stand right next to Nanny, who smells like Vermont.
zh_cn: 我喝完了热可可，站在奶奶身边，她闻上去有股佛蒙特州的气味。

source: A nice cool green smell.
zh_cn: 一种好闻的、清新的绿色草原的气味。

source: She begins to read to me, scrolling slowly down.
zh_cn: 奶奶开始将选项读给我听，一边缓缓拉下滚动条。

source: "Hair colour?"
zh_cn: “头发的颜色？”

source: "Brown."
zh_cn: “棕色。”

source: Mine is honey blond.
zh_cn: 我自己的头发是金黄色的。

source: "Eyes?"
zh_cn: “眼睛？”

source: Mine are blue, so brown again.
zh_cn: 我的眼睛是蓝色的，所以再次选择棕色。

source: "Intelligence?"
zh_cn: “智商呢？”

source: I have to think about that.
zh_cn: 我得好好想想这个问题。

source: I don't want a sister who's stupid, but if she's smarter than me, she will be difficult to boss.
zh_cn: 我不想要一个蠢兮兮的妹妹，可如果她比我聪明，对她发号施令就会有点难度。

source: "Above average," Nanny decides.
zh_cn: “中等偏上。”奶奶做出了决定。

source: "Good at maths?"
zh_cn: “擅长数学吗？”

source: Hmm. I'm in second grade, and we're doing the times tables.
zh_cn: 呣。我现在上二年级，我们正在学乘法表。

source: That could be useful.
zh_cn: 妹妹数学好的话，会很有用。

source: But it probably isn't something she'll be able to do right away.
zh_cn: 但她大概不会一生下来就会做数学题吧。

source: So I shrug, which is a mistake, because Nanny is very strict about manners and posture and I have to listen to a lecture before she will tap the bottom of the screen and scroll to the next page of baby parts.
zh_cn: 于是，我耸了耸肩，我犯了个错，因为奶奶对于姿势和动作之类要求十分严格，从而，在奶奶敲击屏幕底端、滚到关于婴儿部件的下一页之前，我必须听奶奶关于女子仪态的一番唠叨。

source: This page is less interesting because the words are very long and I don't know what they mean.
zh_cn: 这一页上的内容不那么有趣，因为单词都十分长，我也不明白单词的意思。

source: Bioimmunity.
zh_cn: 生物免疫。

source: Cholesterol.
zh_cn: 胆固醇。

source: Neuromuscular.
zh_cn: 神经肌肉。

source: I stare at the screen with my eyes very wide so that I don't yawn out loud.
zh_cn: 我盯着屏幕看，眼睛睁得大大的，那样我才不会哈欠声连连。

source: On the side of the screen is a list, like the menu on the Emirate of Toys site, which I used by myself last year for my Christmas wants.
zh_cn: 在屏幕的一侧，有一个列表，就像“玩具酋长国”网站上的菜单，去年我曾经在那个网站上一个人订购了圣诞节礼物。

source: The baby list is not very long.
zh_cn: 婴儿的列表不是很长。

source: Babies only come in about six colours- we're getting one that matches Mother and me.
zh_cn: 婴儿只有大约六种肤色——我们已经挑选了一种适合妈妈和我的颜色。

source: Humans are a lot less interesting than Legos or iBots.
zh_cn: 人类比乐高玩具或玩具机器人无趣多了。

source: Nanny reads me all the diseases you can ask your baby not to have.
zh_cn: 奶奶向我念了一大串疾病的名称，你可以让婴儿不生这些病症。

source: Most of them are options, she says, which means we have to pay more.
zh_cn: 奶奶说，多数都属于额外选项，也就是说我们要付更多钱。

source: But I think we should pick them all, because a sick sister is not a good thing.
zh_cn: 但我想，我们应该将它们统统选上，因为一个得病的妹妹可不好玩。

source: Angela Xhobi's sister has asthma, because she was made the old-fashioned way, without a menu, and she gets all the attention.
zh_cn: 安琪拉·霍比的妹妹有哮喘病，因为她是用老式的方法生产出来的，当时还没这样的菜单供选择，她妹妹得到了家里人所有的关心。

source: I wouldn't like that at all.
zh_cn: 我可一点也不喜欢那种遭遇。

source: Nanny takes a breath for another lecture, but I am saved when the iVid sings the Phone Call Song.
zh_cn: 奶奶吸了口气，又准备对我进行一番冗长的教育，可电话铃声适时地响起，恰好拯救了我。

source: Nanny sighs again and when she says, "Connect," I see that it's her mother, who calls every afternoon.
zh_cn: 奶奶又叹了口气，说“连接”，我看见打来电话的人是太奶奶，她每天下午都会打电话来。

source: Mrs Nanny is quite deaf, even with her implants, so Nanny taps SAVE on the baby screen and goes downstairs where she can shout without me hearing all the words.
zh_cn: 太奶奶耳朵几乎聋了，尽管安装了助听器也没多大用，于是奶奶点击了屏幕上的“保存”按钮，去了楼下，她在那儿可以大声接电话，不用担心被我听见她们在聊什么。

source: "Little pitchers," she says to her mother as she greys the upstairs iVid.
zh_cn: “小水罐。”奶奶对太奶奶说道，一边将楼上的视频电话机关掉。

source: I don't know what that means.
zh_cn: 我不清楚“小水罐”是什么意思。

source: I slump back into my chair, because Nanny isn't here to tell me not to, and because she will be gone a long time.
zh_cn: 我躺倒在自己的椅子上，因为奶奶不在这儿，没法指责我坐姿不佳，还因为她要离开很久。

source: Her mother always has a lot to say.
zh_cn: 她妈妈总有许多话要说。

source: I stare at all the diseases, and then I see a better word at the bottom of the screen.
zh_cn: 我盯着屏幕上列出的疾病，然后，我看见了屏幕底部的一个单词。

source: PETS.
zh_cn: “宠物”。

source: We don't harbour animals, because Nanny is allergic.
zh_cn: 我们家不养宠物，因为奶奶对宠物过敏。

source: (She was made the old-fashioned way, too.)
zh_cn: （她也是用老式的方法制造出来的。）

source: But I'd like to see what we could have.
zh_cn: 但我想看看，我们能有什么选择。

source: I touch the screen to scroll down for more pets, and a Bubble Man appears, to tell me about a special offer.
zh_cn: 我碰触了屏幕，拉动滚动条，一个泡泡人出现在屏幕上，告诉我有一个特惠礼包。

source: His picture seems to come out of the wall and stand right in front of me.
zh_cn: 泡泡人仿佛是直接从墙壁里走出来，站在我的面前。

source: "Jellyfish DNA on sale," the Bubble Man says.
zh_cn: “发光水母DNA现在有售。”泡泡人说道。

source: He takes off his top hat, pulls a rabbit out of it, and holds it out towards me.
zh_cn: 他摘下高帽，从帽子里掏出一只兔子，然后将兔子递给我。

source: The rabbit's fur glows a soft, bright green.
zh_cn: 兔子的皮毛发出柔和、明亮的绿光。

source: "Wow," I say.
zh_cn: “哇——”我不由地惊叹。

source: "Bioluminescence, 50% off. Today only.
zh_cn: “发光DNA，现在打五折，仅在今天。

source: Touch Box 306a to order!"
zh_cn: 点击306a盒子订购！”

source: He steps back into the screen and disappears with a little picture of smoke.
zh_cn: 泡泡人又踏回到屏幕里，伴随着一阵烟雾，消失不见了。

source: It only takes me a minute to find Box 306a and tap it to red.
zh_cn: 我只花了大约一分钟，就找到了306a盒子，并把它点击成红色。

source: Then I SAVE and scroll back up to the disease boxes.
zh_cn: 然后，我点下了“保存”按钮，又把屏幕滚回到疾病部分。

source: It is good to leave things just the way you found them.
zh_cn: 最好还是把屏幕调整回你动过之前的样子。

source: I sit very straight in my chair, humming, because I know a secret.
zh_cn: 我笔直地坐在椅子里，哼着歌曲，因为现在我心里藏了一个秘密。

source: Once I have my baby sister, I will never need my nightlight again.
zh_cn: 一等我的小妹妹诞生，我就再也不需要自己的小夜灯啦。

source: Nanny will be so proud.
zh_cn: 奶奶肯定会为我感到自豪的。
